<?php
if (isset($_REQUEST["form"])) {
    $password = $_POST['form'];

    $re = '/([a-z]{2,}?[A-Z]{2,}?[0-9]{2,}?[%|$|#|_|]{2,}?){10,}/';

   $r2 =  '/\S*(?=\S{10,})((?=\S*[a-z]\S*[a-z])(?=\S*[A-Z]\S*[A-Z])(?=\S*[\d]\S*[\d])(?=\S*[%|$|#|_|*]\S*[%|$|#|_|*])\S*)/';
   //можно .* вместо \S*

    $r4 = '/(.*[A-Z]{4,})|(.*[a-z]{4,})|(.*[\d]{4,})|(.*[$|#|%|_|*]{4,})/';

    $flag = false;

    if (preg_match($r2,$password)){
        if (preg_match($r4,$password)){
            echo 'Пароль не  должен содержать более чем 3 символов любой категории подряд';
        } else
            echo "надежен";
    }else{
        if (strlen($password) < 10) {
            echo "длина должна быть больше или равна 10 символов";
        } else echo "пароль должен содержать хотя бы по 2 символа из каждой категории:
         латинские прописные буквы; латинские строчные буквы; цифры; символы %$#_*";
    }
    if ($flag === false) {
        require("form.html");
    }
}//закрытие if
else {
    require("form.html");
}